[{"description":"Create a medical shift tracking dashboard with professional healthcare aesthetic. Include navigation with logo area, user profile section, and main menu items for Dashboard, Plantões (shifts), Financeiro (financial), and Calendário (calendar)","type":"feature","passes":true,"id":1},{"description":"Build a comprehensive calendar view similar to Google Calendar that displays scheduled shifts. Calendar should show month view with ability to add, edit, and view shift details. Each shift should display time, location, and payment status","type":"feature","passes":true,"id":2},{"description":"Create a shift registration system where users can add new shifts with fields for: date, start/end time, location/hospital, specialty, shift type, and payment amount. Include form validation","type":"feature","passes":true,"id":3},{"description":"Build a financial overview dashboard showing total received, total pending, and upcoming payments. Display this with clear visual cards and include a detailed transactions list showing shift date, location, amount, and payment status (received/pending)","type":"feature","passes":true,"id":4},{"description":"Create interactive charts for financial data visualization: monthly income bar chart, payment status pie chart (received vs pending), and income trend line chart over time","type":"feature","passes":true,"id":5},{"description":"Implement data persistence using browser localStorage so shift data, payments, and calendar entries are saved between sessions","type":"feature","passes":true,"id":6},{"description":"Make the entire application fully responsive for mobile, tablet, and desktop use with professional medical/healthcare color scheme","type":"feature","passes":true,"id":7},{"description":"Fix the Próximos Plantões section showing incorrect month - when user adds a shift in February, it's displaying as January. This is likely a month indexing issue (0-based vs 1-based). Correct the date handling to show the accurate month","type":"bug","passes":true,"id":8},{"description":"Add filter controls to the calendar view with dropdowns for Hospital and Especialidade. Filters should show all unique hospitals and specialties from existing shifts, with an 'Todos' option. When filters are applied, only matching shifts should appear in the calendar and upcoming shifts list","type":"feature","passes":true,"id":9},{"description":"Apply exact text content changes: In src/web/components/layout/sidebar.tsx at line 66, change 'MedShifts' to 'MedPlantão'. At line 67, change 'Gestão de Plantões' to 'Gestão de Plantões Médicos'","type":"feature","passes":true,"id":10},{"description":"Apply exact text content change: In src/web/components/layout/sidebar.tsx at line 105, change 'Dr. Médico' to 'Dr. Danillo Lobo'","type":"feature","passes":true,"id":11},{"description":"Implement saved locations feature: When user types a hospital/local name, save it to localStorage. Show previously used locations as suggestions/dropdown in the location field for easy selection in future shifts. Include ability to quickly select from recent locations","type":"feature","passes":true,"id":12},{"description":"Add color picker to the shift form. Include a set of predefined colors (blue, green, red, purple, orange, yellow, teal, pink) that users can choose from when creating/editing a shift. Each shift should store its selected color","type":"feature","passes":true,"id":13},{"description":"Update calendar view to display shifts with their assigned colors. Show colored indicators/badges on calendar dates, and use the same colors in the upcoming shifts list and shift details. Make the color coding consistent throughout the interface","type":"feature","passes":true,"id":14},{"description":"Add recurring shift functionality to the shift form. Include a toggle/checkbox for 'Repetir Plantão' that reveals recurrence options when enabled. Options should include: Não repetir (default), Diariamente, Semanalmente (every week same day), Segunda a Sexta, Dias específicos da semana (multiple selection), Custom (specific dates). When enabled, ask for end date or number of occurrences. Generate multiple shifts based on the recurrence pattern selected","type":"feature","passes":true,"id":15},{"description":"Create a location management interface accessible from the shift form or settings. Allow users to view all saved locations, edit location names, delete unwanted locations, and manually add new locations to the saved list. Include search/filter capability if there are many locations. Show how many times each location has been used","type":"feature","passes":true,"id":16},{"description":"Add hover/touch tooltips to the monthly revenue bar chart. When user hovers over a bar (desktop) or taps it (mobile), display a tooltip showing the exact revenue amount for that month","type":"feature","passes":true,"id":17},{"description":"Add year filter to financial dashboard. Display total income per year as a summary metric. Add year dropdown/tabs to filter all charts and transactions to show data for a selected year. Update pie chart and bar chart to reflect the selected year's data","type":"feature","passes":true,"id":18},{"description":"Add hospital/location filter to financial dashboard. Filter monthly revenue chart, pie chart, and all transactions by selected hospital. Show 'Todos os Hospitais' option plus all unique hospitals from shifts","type":"feature","passes":true,"id":19},{"description":"Remove ESPECIALIDADE and TIPO DE PLANTAO fields from the shift registration form. Simplify the form to only include: date, start time, end time, location (with saved suggestions), and color selection","type":"feature","passes":true,"id":20},{"description":"Remove 'valor recebido' field from individual shift registration. In the Financial menu (Financeiro tab), add two input fields at the top: 'Valor Esperado para o Mês' and 'Valor Realmente Recebido'. These monthly financial targets should be stored in localStorage and used to calculate all financial charts and metrics instead of per-shift values","type":"feature","passes":true,"id":21},{"description":"Fix the freeze/hang issue in the 'DIAS ESPECIFICOS' option in the recurring shift form. Debug and ensure the multiple day selection works smoothly. Test that users can select/deselect days of the week without the interface freezing or becoming unresponsive","type":"feature","passes":true,"id":22},{"description":"Optimize the mobile layout for the shift registration form. Reduce padding, improve field sizing, adjust font sizes, and ensure all form elements are comfortably usable on mobile screens without breaking the layout. Test on small screens to ensure proper responsiveness","type":"feature","passes":true,"id":23},{"description":"Integrate Runable database backend. Connect the application to use Runable's database for storing shifts, locations, and financial data instead of localStorage only. Implement data sync between frontend and database with proper error handling","type":"feature","passes":true,"id":24}]